tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k22_tdd.h
#define SENDB2                        522
#define TXSTA2_SENDB                  523
#define TXSTA2_SYNC                   524
#define SYNC2                         525
#define TXEN2                         526
#define TXSTA2_TXEN                   527
#define TX8_92                        528
#define TX92                          529
#define TXSTA2_TX9                    530
#define TXSTA2_CSRC                   531
#define CSRC2                         532
#define TXREG2                        533
#define TX2REG                        534
#define RCREG2                        535
#define RC2REG                        536
#define SPBRG2                        537
#define SP2BRG                        538
#define SPBRGH2                       539
#define SP2BRGH                       540
#define CM2CON1                       541
#define C2SYNC                        542
#define C1SYNC                        543
#define C2HYS                         544
#define C1HYS                         545
#define C2RSEL                        546
#define C1RSEL                        547
#define MC2OUT                        548
#define MC1OUT                        549
#define CM2CON0                       550
#define CCH02                         551
#define C2CH0                         552
#define C2CH                          553
#define C2CH1                         554
#define CCH12                         555
#define C2R                           556
#define CREF2                         557
#define EVPOL02                       558
#define C2SP                          559
#define EVPOL12                       560
#define C2POL                         561
#define CPOL2                         562
#define C2OE                          563
#define CM2CON0_C2OUT                 564
#define COE2                          565
#define CON2                          566
#define C2ON                          567
#define CM1CON0                       568
#define C1CH0                         569
#define C1CH                          570
#define CCH01                         571
#define CCH0                          572
#define CCH11                         573
#define C1CH1                         574
#define CCH1                          575
#define CREF1                         576
#define C1R                           577
#define CREF                          578
#define EVPOL01                       579
#define EVPOL0                        580
#define C1SP                          581
#define EVPOL1                        582
#define EVPOL11                       583
#define C1POL                         584
#define C1OE                          585
#define CPOL                          586
#define CPOL1                         587
#define COE                           588
#define CM1CON0_C1OUT                 589
#define COE1                          590
#define CON                           591
#define C1ON                          592
#define CON1                          593
#define PIE4                          594
#define CCP3IE                        595
#define CCP4IE                        596
#define CCP5IE                        597
#define PIR4                          598
#define CCP3IF                        599
#define CCP4IF                        600
#define CCP5IF                        601
#define IPR4                          602
#define CCP3IP                        603
#define CCIP3IP                       604
#define CCP4IP                        605
#define CCP5IP                        606
#define PIE5                          607
#define TMR4IE                        608
#define TMR5IE                        609
#define TMR6IE                        610
#define PIR5                          611
#define TMR4IF                        612
#define TMR5IF                        613
#define TMR6IF                        614
#define IPR5                          615
#define TMR4IP                        616
#define CCH05                         617
#define CCH15                         618
#define TMR5IP                        619
#define TMR6IP                        620
#define PORTA                         621
#define ULPWUIN                       622
#define AN0                           623
#define PORTA_RA0                     624
#define C12IN0M                       625
#define C12IN0N                       626
#define AN1                           627
#define C12IN1N                       628
#define C12IN1M                       629
#define PORTA_RA1                     630
#define AN2                           631
#define DACOUT                        632
#define PORTA_RA2                     633
#define CVREF                         634
#define VREFN                         635
#define VREFM                         636
#define C2INP                         637
#define C1INP                         638
#define AN3                           639
#define PORTA_RA3                     640
#define VREFP                         641
#define PORTA_C1OUT                   642
#define PORTA_RA4                     643
#define T0CKI                         644
#define SRQ                           645
#define PORTA_C2OUT                   646
#define SS1                           647
#define AN4                           648
#define PORTA_RA5                     649
#define NOT_SS                        650
#define nSS1                          651
#define NOT_SS1                       652
#define LVDIN                         653
#define nSS                           654
#define SS                            655
#define SRNQ                          656
#define HLVDIN                        657
#define PORTA_RA6                     658
#define PORTA_RA7                     659
#define RJPU                          660
#define PORTB                         661
#define FLT0                          662
#define INT0                          663
#define SRI                           664
#define PORTB_RB0                     665
#define AN12                          666
#define C12IN3M                       667
#define C12IN3N                       668
#define INT1                          669
#define PORTB_RB1                     670
#define AN10                          671
#define AN8                           672
#define INT2                          673
#define CTED1                         674
#define PORTB_RB2                     675
#define AN9                           676
#define PORTB_CCP2                    677
#define CCP2_PA2                      678
#define C12IN2N                       679
#define CTED2                         680
#define C12IN2M                       681
#define PORTB_RB3                     682
#define PORTB_P2A                     683
#define PORTB_RB4                     684
#define KBI0                          685
#define T5G                           686
#define AN11                          687
#define PORTB_CCP3                    688
#define PORTB_RB5                     689
#define PORTB_P3A                     690
#define T1G                           691
#define KBI1                          692
#define AN13                          693
#define PORTB_T3CKI                   694
#define PORTB_RB6                     695
#define PGC                           696
#define KBI2                          697
#define PGD                           698
#define PORTB_RB7                     699
#define KBI3                          700
#define PORTC                         701
#define T1CKI                         702
#define T1OSO                         703
#define PORTC_T3CKI                   704
#define PORTC_RC0                     705
#define T3G                           706
#define PORTC_P2B                     707
#define PORTC_CCP2                    708
#define PORTC_P2A                     709
#define PORTC_RC1                     710
#define T1OSI                         711
#define PA2                           712
#define CCP1                          713
#define CTPLS                         714
#define P1A                           715
#define T5CKI                         716
#define PA1                           717
#define AN14                          718
#define PORTC_RC2                     719
#define SCK1                          720
#define SCL                           721
#define SCK                           722
#define SCL1                          723
#define AN15                          724
#define PORTC_RC3                     725
#define PORTC_RC4                     726
#define SDI1                          727
#define SDA1                          728
#define AN16                          729
#define SDA                           730
#define SDI                           731
#define PORTC_RC5                     732
#define SDO1                          733
#define AN17                          734
#define SDO                           735
#define PORTC_RC6                     736
#define CK                            737
#define TX1                           738
#define TX                            739
#define CK1                           740
#define AN18                          741
#define DT                            742
#define RX                            743
#define RX1                           744
#define PORTC_RC7                     745
#define DT1                           746
#define AN19                          747
#define PORTD                         748
#define SCK2                          749
#define AN20                          750
#define SCL2                          751
#define PORTD_RD0                     752
#define CCP4                          753
#define AN21                          754
#define SDI2                          755
#define SDA2                          756
#define PORTD_RD1                     757
#define PORTD_P2B                     758
#define AN22                          759
#define PORTD_RD2                     760
#define P2C                           761
#define SS2                           762
#define NOT_SS2                       763
#define nSS2                          764
#define AN23                          765
#define PORTD_RD3                     766
#define P2D                           767
#define AN24                          768
#define SDO2                          769
#define PORTD_RD4                     770
#define P1B                           771
#define AN25                          772
#define PORTD_RD5                     773
#define P1C                           774
#define AN26                          775
#define TX2                           776
#define PORTD_RD6                     777
#define CK2                           778
#define AN27                          779
#define RX2                           780
#define P1D                           781
#define PORTD_RD7                     782
#define DT2                           783
#define PORTE                         784
#define PORTE_CCP3                    785
#define AN5                           786
#define PD2                           787
#define RDE                           788
#define PORTE_P3A                     789
#define PORTE_RE0                     790
#define AN6                           791
#define WRE                           792
#define P3B                           793
#define PORTE_RE1                     794
#define PC2                           795
#define AN7                           796
#define CCP5                          797
#define CCP10                         798
#define PB2                           799
#define CS                            800
#define PORTE_RE2                     801
#define VPP                           802
#define CCP9E                         803
#define RE3                           804
#define NOT_MCLR                      805
#define MCLR                          806
#define nMCLR                         807
#define PC3E                          808
#define LATA                          809
#define LATA0                         810
#define LA0                           811
#define LATA1                         812
#define LA1                           813
#define LATA2                         814
#define LA2                           815
#define LATA3                         816
#define LA3                           817
#define LATA4                         818
#define LA4                           819
#define LATA5                         820
#define LA5                           821
#define LATA6                         822
#define LA6                           823
#define LATA7                         824
#define LA7                           825
#define LATB                          826
#define LB0                           827
#define LATB0                         828
#define LB1                           829
#define LATB1                         830
#define LB2                           831
#define LATB2                         832
#define LB3                           833
#define LATB3                         834
#define LB4                           835
#define LATB4                         836
#define LB5                           837
#define LATB5                         838
#define LB6                           839
#define LATB6                         840
#define LB7                           841
#define LATB7                         842
#define LATC                          843
#define LATC0                         844
#define LC0                           845
#define LATC1                         846
#define LC1                           847
#define LATC2                         848
#define LC2                           849
#define LATC3                         850
#define LC3                           851
#define LATC4                         852
#define LC4                           853
#define LATC5                         854
#define LC5                           855
#define LATC6                         856
#define LC6                           857
#define LATC7                         858
#define LC7                           859
#define LATD                          860
#define LATD0                         861
#define LD0                           862
#define LATD1                         863
#define LD1                           864
#define LATD2                         865
#define LD2                           866
#define LATD3                         867
#define LD3                           868
#define LATD4                         869
#define LD4                           870
#define LATD5                         871
#define LD5                           872
#define LATD6                         873
#define LD6                           874
#define LATD7                         875
#define LD7                           876
#define LATE                          877
#define LATE0                         878
#define LE0                           879
#define LATE1                         880
#define LE1                           881
#define LATE2                         882
#define LE2                           883
#define TRISA                         884
#define TRISA0                        885
#define TRISA_RA0                     886
#define TRISA1                        887
#define TRISA_RA1                     888
#define TRISA2                        889
#define TRISA_RA2                     890
#define TRISA3                        891
#define TRISA_RA3                     892
#define TRISA_RA4                     893
#define TRISA4                        894
#define TRISA_RA5                     895
#define TRISA5                        896
#define TRISA_RA6                     897
#define TRISA6                        898
#define TRISA_RA7                     899
#define TRISA7                        900
#define TRISB                         901
#define TRISB_RB0                     902
#define TRISB0                        903
#define TRISB_RB1                     904
#define TRISB1                        905
#define TRISB_RB2                     906
#define TRISB2                        907
#define TRISB_RB3                     908
#define TRISB3                        909
#define TRISB_RB4                     910
#define TRISB4                        911
#define TRISB_RB5                     912
#define TRISB5                        913
#define TRISB_RB6                     914
#define TRISB6                        915
#define TRISB_RB7                     916
#define TRISB7                        917
#define TRISC                         918
#define TRISC0                        919
#define TRISC_RC0                     920
#define TRISC1                        921
#define TRISC_RC1                     922
#define TRISC2                        923
#define TRISC_RC2                     924
#define TRISC3                        925
#define TRISC_RC3                     926
#define TRISC4                        927
#define TRISC_RC4                     928
#define TRISC5                        929
#define TRISC_RC5                     930
#define TRISC6                        931
#define TRISC_RC6                     932
#define TRISC7                        933
#define TRISC_RC7                     934
#define TRISD                         935
#define TRISD_RD0                     936
#define TRISD0                        937
#define TRISD_RD1                     938
#define TRISD1                        939
#define TRISD_RD2                     940
#define TRISD2                        941
#define TRISD_RD3                     942
#define TRISD3                        943
#define TRISD_RD4                     944
#define TRISD4                        945
#define TRISD_RD5                     946
#define TRISD5                        947
#define TRISD_RD6                     948
#define TRISD6                        949
#define TRISD_RD7                     950
#define TRISD7                        951
#define TRISE                         952
#define TRISE_RE0                     953
#define TRISE0                        954
#define TRISE_RE1                     955
#define TRISE1                        956
#define TRISE_RE2                     957
#define TRISE2                        958
#define WPUE3                         959
#define OSCTUNE                       960
#define TUN0                          961
#define TUN                           962
#define TUN1                          963
#define TUN2                          964
#define TUN3                          965
#define TUN4                          966
#define TUN5                          967
#define PLLEN                         968
#define INTSRC                        969
#define HLVDCON                       970
#define HLVDL                         971
#define HLVDL0                        972
#define LVV0                          973
#define LVDL0                         974
#define LVV1                          975
#define HLVDL1                        976
#define LVDL1                         977
#define HLVDL2                        978
#define LVV2                          979
#define LVDL2                         980
#define HLVDL3                        981
#define LVV3                          982
#define LVDL3                         983
#define HLVDEN                        984
#define LVDEN                         985
#define BGST                          986
#define IRVST                         987
#define IVRST                         988
#define BGVST                         989
#define VDIRMAG                       990
#define PIE1                          991
#define TMR1IE                        992
#define TMR2IE                        993
#define CCP1IE                        994
#define SSP1IE                        995
#define SSPIE                         996
#define TXIE                          997
#define TX1IE                         998
#define RC1IE                         999
#define RCIE                          1000
#define ADIE                          1001
#define PIR1                          1002
#define TMR1IF                        1003
#define TMR2IF                        1004
#define CCP1IF                        1005
#define SSPIF                         1006
#define SSP1IF                        1007
#define TXIF                          1008
#define TX1IF                         1009
#define RCIF                          1010
#define RC1IF                         1011
#define ADIF                          1012
#define IPR1                          1013
#define TMR1IP                        1014
#define TMR2IP                        1015
#define CCP1IP                        1016
#define SSPIP                         1017
#define SSP1IP                        1018
#define TX1IP                         1019
#define TXIP                          1020
#define RCIP                          1021
#define RC1IP                         1022
#define ADIP                          1023
#define PIE2                          1024
#define CCP2IE                        1025
#define TMR3IE                        1026
#define HLVDIE                        1027
#define LVDIE                         1028
#define BCL1IE                        1029
#define BCLIE                         1030
#define EEIE                          1031
#define C2IE                          1032
#define C1IE                          1033
#define CMIE                          1034
#define OSCFIE                        1035
#define PIR2                          1036
#define CCP2IF                        1037
#define TMR3IF                        1038
#define HLVDIF                        1039
#define LVDIF                         1040
#define BCL1IF                        1041
#define BCLIF                         1042
#define EEIF                          1043
#define C2IF                          1044
#define C1IF                          1045
#define CMIF                          1046
#define OSCFIF                        1047
#define IPR2                          1048
#define CCP2IP                        1049
#define TMR3IP                        1050
#define HLVDIP                        1051
#define LVDIP                         1052
#define BCLIP                         1053
#define BCL1IP                        1054
#define EEIP                          1055
#define C2IP                          1056
#define C1IP                          1057
#define CMIP                          1058
#define OSCFIP                        1059
#define PIE3                          1060
#define RXB0IE                        1061
#define TMR1GIE                       1062
#define RXBNIE                        1063
#define TMR3GIE                       1064
#define RXB1IE                        1065
#define TMR5GIE                       1066
#define TXB0IE                        1067
#define CTMUIE                        1068
#define TXB1IE                        1069
#define TXBNIE                        1070
#define TXB2IE                        1071
#define TX2IE                         1072
#define RC2IE                         1073
#define BCL2IE                        1074
#define SSP2IE                        1075
#define PIR3                          1076
#define TMR1GIF                       1077
#define RXBNIF                        1078
#define TMR3GIF                       1079
#define TMR5GIF                       1080
#define CTMUIF                        1081
#define TX2IF                         1082
#define TXBNIF                        1083
#define RC2IF                         1084
#define BCL2IF                        1085
#define SSP2IF                        1086
#define IPR3                          1087
#define TMR1GIP                       1088
#define TMR3GIP                       1089
#define RXBNIP                        1090
