tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k22_tdd.h
#define TMR5GIP                       1091
#define CTMUIP                        1092
#define TXBNIP                        1093
#define TX2IP                         1094
#define RC2IP                         1095
#define BCL2IP                        1096
#define SSP2IP                        1097
#define EECON1                        1098
#define RD                            1099
#define WR                            1100
#define WREN                          1101
#define WRERR                         1102
#define FREE                          1103
#define CFGS                          1104
#define EEFS                          1105
#define EEPGD                         1106
#define EECON2                        1107
#define EEDATA                        1108
#define EEADR                         1109
#define EEADR0                        1110
#define EEADR1                        1111
#define EEADR2                        1112
#define EEADR3                        1113
#define EEADR4                        1114
#define EEADR5                        1115
#define EEADR6                        1116
#define EEADR7                        1117
#define EEADRH                        1118
#define EEADR8                        1119
#define EEADR9                        1120
#define RCSTA1                        1121
#define RCSTA1_RX9D                   1122
#define RX9D1                         1123
#define RCD8                          1124
#define RCSTA1_OERR                   1125
#define OERR1                         1126
#define RCSTA1_FERR                   1127
#define FERR1                         1128
#define RCSTA1_ADDEN                  1129
#define RCSTA1_ADEN                   1130
#define ADDEN1                        1131
#define RCSTA1_CREN                   1132
#define CREN1                         1133
#define SRENA                         1134
#define SREN1                         1135
#define RCSTA1_SREN                   1136
#define RC8_9                         1137
#define RCSTA1_RX9                    1138
#define RC9                           1139
#define RX91                          1140
#define RCSTA1_SPEN                   1141
#define SPEN1                         1142
#define TXSTA1                        1143
#define TX9D1                         1144
#define TXSTA1_TX9D                   1145
#define TXD8                          1146
#define TRMT1                         1147
#define TXSTA1_TRMT                   1148
#define BRGH1                         1149
#define TXSTA1_BRGH                   1150
#define TXSTA1_SENDB                  1151
#define SENDB1                        1152
#define TXSTA1_SYNC                   1153
#define SYNC1                         1154
#define TXEN1                         1155
#define TXSTA1_TXEN                   1156
#define TX91                          1157
#define TX8_9                         1158
#define TXSTA1_TX9                    1159
#define TXSTA1_CSRC                   1160
#define CSRC1                         1161
#define TXREG1                        1162
#define TXREG                         1163
#define TX1REG                        1164
#define RCREG1                        1165
#define RCREG                         1166
#define RC1REG                        1167
#define SPBRG1                        1168
#define SPBRG                         1169
#define SP1BRG                        1170
#define SPBRGH1                       1171
#define SP1BRGH                       1172
#define SPBRGH                        1173
#define T3CON                         1174
#define TMR3ON                        1175
#define T3RD16                        1176
#define nT3SYNC                       1177
#define NOT_T3SYNC                    1178
#define SOSCEN3                       1179
#define T3SOSCEN                      1180
#define T3OSCEN                       1181
#define T3CKPS                        1182
#define T3CKPS0                       1183
#define T3CKPS1                       1184
#define TMR3CS0                       1185
#define TMR3CS                        1186
#define TMR3CS1                       1187
#define RD163                         1188
#define TMR3L                         1189
#define TMR3H                         1190
#define T3GCON                        1191
#define T3GSS0                        1192
#define T3GSS                         1193
#define T3GSS1                        1194
#define T3GVAL                        1195
#define T3GGO                         1196
#define T3GGO_NOT_DONE                1197
#define T3G_DONE                      1198
#define T3GGO_nDONE                   1199
#define T3GSPM                        1200
#define T3GTM                         1201
#define T3GPOL                        1202
#define TMR3GE                        1203
#define ECCP1AS                       1204
#define P1SSBD0                       1205
#define PSS1BD                        1206
#define P1SSBD                        1207
#define PSSBD                         1208
#define PSSBD0                        1209
#define PSS1BD0                       1210
#define P1SSBD1                       1211
#define PSSBD1                        1212
#define PSS1BD1                       1213
#define P1SSAC0                       1214
#define PSSAC                         1215
#define PSS1AC                        1216
#define PSSAC0                        1217
#define PSS1AC0                       1218
#define P1SSAC                        1219
#define P1SSAC1                       1220
#define PSSAC1                        1221
#define PSS1AC1                       1222
#define CCP1AS0                       1223
#define CCP1AS                        1224
#define ECCPAS                        1225
#define ECCPAS0                       1226
#define CCP1AS1                       1227
#define ECCPAS1                       1228
#define CCP1AS2                       1229
#define ECCPAS2                       1230
#define ECCPASE                       1231
#define CCP1ASE                       1232
#define PWM1CON                       1233
#define PDC0                          1234
#define P1DC                          1235
#define P1DC0                         1236
#define PDC                           1237
#define PDC1                          1238
#define P1DC1                         1239
#define PDC2                          1240
#define P1DC2                         1241
#define PDC3                          1242
#define P1DC3                         1243
#define PDC4                          1244
#define P1DC4                         1245
#define PDC5                          1246
#define P1DC5                         1247
#define P1DC6                         1248
#define PDC6                          1249
#define PRSEN                         1250
#define P1RSEN                        1251
#define BAUDCON1                      1252
#define BAUDCON1_ABDEN                1253
#define ABDEN1                        1254
#define BAUDCON1_WUE                  1255
#define WUE1                          1256
#define W4E                           1257
#define BRG161                        1258
#define BAUDCON1_BRG16                1259
#define BAUDCON1_CKTXP                1260
#define SCKP1                         1261
#define TXCKP                         1262
#define BAUDCON1_SCKP                 1263
#define TXCKP1                        1264
#define DTRXP1                        1265
#define RXDTP1                        1266
#define RXCKP                         1267
#define BAUDCON1_DTRXP                1268
#define RXDTP                         1269
#define RCMT1                         1270
#define RCIDL1                        1271
#define BAUDCON1_RCIDL                1272
#define RCMT                          1273
#define ABDOVF1                       1274
#define BAUDCON1_ABDOVF               1275
#define PSTR1CON                      1276
#define STR1A                         1277
#define STRA                          1278
#define STR1B                         1279
#define STRB                          1280
#define STR1C                         1281
#define STRC                          1282
#define STR1D                         1283
#define STRD                          1284
#define STR1SYNC                      1285
#define STRSYNC                       1286
#define T2CON                         1287
#define T2CKPS0                       1288
#define T2CKPS                        1289
#define T2CKPS1                       1290
#define TMR2ON                        1291
#define T2OUTPS0                      1292
#define T2OUTPS                       1293
#define T2OUTPS1                      1294
#define T2OUTPS2                      1295
#define T2OUTPS3                      1296
#define PR2                           1297
#define TMR2                          1298
#define CCP1CON                       1299
#define CCP1M0                        1300
#define CCP1M                         1301
#define CCP1M1                        1302
#define CCP1M2                        1303
#define CCP1M3                        1304
#define DC1B                          1305
#define DC1B0                         1306
#define DC1B1                         1307
#define P1M                           1308
#define P1M0                          1309
#define P1M1                          1310
#define CCPR1L                        1311
#define CCPR1H                        1312
#define ADCON2                        1313
#define ADCS0                         1314
#define ADCS                          1315
#define ADCS1                         1316
#define ADCS2                         1317
#define ACQT0                         1318
#define ACQT                          1319
#define ACQT1                         1320
#define ACQT2                         1321
#define ADFM                          1322
#define ADCON1                        1323
#define NVCFG                         1324
#define NVCFG0                        1325
#define NVCFG1                        1326
#define PVCFG                         1327
#define PVCFG0                        1328
#define CHSN3                         1329
#define PVCFG1                        1330
#define TRIGSEL                       1331
#define ADCON0                        1332
#define ADON                          1333
#define nDONE                         1334
#define GO_nDONE                      1335
#define NOT_DONE                      1336
#define GODONE                        1337
#define GO_DONE                       1338
#define DONE                          1339
#define GO_NOT_DONE                   1340
#define GO                            1341
#define CHS                           1342
#define CHS0                          1343
#define CHS1                          1344
#define CHS2                          1345
#define CHS3                          1346
#define CHS4                          1347
#define ADRESL                        1348
#define ADRESH                        1349
#define SSP1CON2                      1350
#define SEN1                          1351
#define SSP1CON2_SEN                  1352
#define ADMSK11                       1353
#define SSP1CON2_RSEN                 1354
#define RSEN1                         1355
#define ADMSK1                        1356
#define SSP1CON2_PEN                  1357
#define ADMSK21                       1358
#define PEN1                          1359
#define ADMSK2                        1360
#define ADMSK31                       1361
#define RCEN1                         1362
#define SSP1CON2_RCEN                 1363
#define ADMSK3                        1364
#define SSP1CON2_ACKEN                1365
#define ACKEN1                        1366
#define ADMSK41                       1367
#define ADMSK4                        1368
#define ACKDT1                        1369
#define ADMSK51                       1370
#define SSP1CON2_ACKDT                1371
#define ADMSK5                        1372
#define SSP1CON2_ACKSTAT              1373
#define ACKSTAT1                      1374
#define GCEN1                         1375
#define SSP1CON2_GCEN                 1376
#define SSP1CON1                      1377
#define SSP1CON1_SSPM0                1378
#define SSPM01                        1379
#define SSP1CON1_SSPM                 1380
#define SSP1CON1_SSPM1                1381
#define SSPM11                        1382
#define SSP1CON1_SSPM2                1383
#define SSPM21                        1384
#define SSPM31                        1385
#define SSP1CON1_SSPM3                1386
#define SSP1CON1_CKP                  1387
#define CKP1                          1388
#define SSPEN1                        1389
#define SSP1CON1_SSPEN                1390
#define SSPOV1                        1391
#define SSP1CON1_SSPOV                1392
#define WCOL1                         1393
#define SSP1CON1_WCOL                 1394
#define SSP1STAT                      1395
#define BF1                           1396
#define SSP1STAT_BF                   1397
#define UA1                           1398
#define SSP1STAT_UA                   1399
#define SSP1STAT_R_NOT_W              1400
#define READ_WRITE                    1401
#define RW1                           1402
#define NOT_W                         1403
#define SSP1STAT_W                    1404
#define I2C_READ                      1405
#define SSP1STAT_R                    1406
#define SSP1STAT_nW                   1407
#define RW                            1408
#define SSP1STAT_NOT_WRITE            1409
#define SSP1STAT_nWRITE               1410
#define SSP1STAT_R_W                  1411
#define SSP1STAT_R_nW                 1412
#define SSP1STAT_S                    1413
#define START                         1414
#define START1                        1415
#define I2C_START                     1416
#define STOP                          1417
#define SSP1STAT_P                    1418
#define STOP1                         1419
#define I2C_STOP                      1420
#define SSP1STAT_D                    1421
#define SSP1STAT_D_NOT_A              1422
#define NOT_A                         1423
#define SSP1STAT_D_A                  1424
#define SSP1STAT_D_nA                 1425
#define SSP1STAT_NOT_ADDRESS          1426
#define SSP1STAT_nA                   1427
#define SSP1STAT_A                    1428
#define DA1                           1429
#define DA                            1430
#define DATA_ADDRESS                  1431
#define SSP1STAT_nADDRESS             1432
#define I2C_DAT                       1433
#define SSP1STAT_CKE                  1434
#define CKE1                          1435
#define SSP1STAT_SMP                  1436
#define SMP1                          1437
#define SSP1ADD_SSPADD                1438
#define SSP1ADD_MSK0                  1439
#define MSK01                         1440
#define SSP1ADD                       1441
#define SSP1ADD_MSK1                  1442
#define MSK11                         1443
#define SSP1ADD_MSK2                  1444
#define MSK21                         1445
#define MSK31                         1446
#define SSP1ADD_MSK3                  1447
#define SSP1ADD_MSK4                  1448
#define MSK41                         1449
#define MSK51                         1450
#define SSP1ADD_MSK5                  1451
#define MSK61                         1452
#define SSP1ADD_MSK6                  1453
#define SSP1ADD_MSK7                  1454
#define MSK71                         1455
#define SSP1BUF_SSPBUF                1456
#define SSP1BUF                       1457
#define SSP1MSK                       1458
#define SSP1MSK_MSK0                  1459
#define SSP1MSK_MSK1                  1460
#define SSP1MSK_MSK2                  1461
#define SSP1MSK_MSK3                  1462
#define SSP1MSK_MSK4                  1463
#define SSP1MSK_MSK5                  1464
#define SSP1MSK_MSK6                  1465
#define SSP1MSK_MSK7                  1466
#define SSP1CON3                      1467
#define SSP1CON3_DHEN                 1468
#define SSP1CON3_AHEN                 1469
#define SSP1CON3_SBCDE                1470
#define SSP1CON3_SDAHT                1471
#define SSP1CON3_BOEN                 1472
#define SSP1CON3_SCIE                 1473
#define SSP1CON3_PCIE                 1474
#define SSP1CON3_ACKTIM               1475
#define T1GCON                        1476
#define T1GSS0                        1477
#define T1GSS                         1478
#define T1GSS1                        1479
#define T1GVAL                        1480
#define T1GGO_NOT_DONE                1481
#define T1GGO_nDONE                   1482
#define T1G_DONE                      1483
#define T1GGO                         1484
#define T1GSPM                        1485
#define T1GTM                         1486
#define T1GPOL                        1487
#define TMR1GE                        1488
#define T1CON                         1489
#define TMR1ON                        1490
#define RD16                          1491
#define T1RD16                        1492
#define NOT_T1SYNC                    1493
#define T1SYNC                        1494
#define nT1SYNC                       1495
#define T1SOSCEN                      1496
#define T1OSCEN                       1497
#define SOSCEN                        1498
#define T1CKPS0                       1499
#define T1CKPS                        1500
#define T1CKPS1                       1501
#define TMR1CS0                       1502
#define TMR1CS                        1503
#define TMR1CS1                       1504
#define TMR1L                         1505
#define TMR1H                         1506
#define RCON                          1507
#define BOR                           1508
#define NOT_BOR                       1509
#define nBOR                          1510
#define POR                           1511
#define nPOR                          1512
#define NOT_POR                       1513
#define PD                            1514
#define nPD                           1515
#define NOT_PD                        1516
#define NOT_TO                        1517
#define nTO                           1518
#define TO                            1519
#define nRI                           1520
#define NOT_RI                        1521
#define RI                            1522
#define SBOREN                        1523
#define IPEN                          1524
#define WDTCON                        1525
#define SWDTE                         1526
#define SWDTEN                        1527
#define OSCCON2                       1528
#define LFIOFS                        1529
#define MFIOFS                        1530
#define PRISD                         1531
#define SOSCGO                        1532
#define MFIOSEL                       1533
#define SOSCRUN                       1534
#define PLLRDY                        1535
#define OSCCON                        1536
#define SCS0                          1537
#define SCS                           1538
#define SCS1                          1539
#define IOFS                          1540
#define HFIOFS                        1541
#define OSTS                          1542
#define IRCF                          1543
#define IRCF0                         1544
#define IRCF1                         1545
#define IRCF2                         1546
#define IDLEN                         1547
#define T0CON                         1548
#define T0PS                          1549
#define T0PS0                         1550
#define T0PS1                         1551
#define T0PS2                         1552
#define PSA                           1553
#define T0SE                          1554
#define T0CS                          1555
#define T08BIT                        1556
#define TMR0ON                        1557
#define TMR0L                         1558
#define TMR0H                         1559
#define STATUS                        1560
#define C                             1561
#define CARRY                         1562
#define DC                            1563
#define ZERO                          1564
#define Z                             1565
#define OV                            1566
#define OVERFLOW                      1567
#define N                             1568
#define NEGATIVE                      1569
#define FSR2L                         1570
#define PLUSW2                        1571
#define PREINC2                       1572
#define POSTDEC2                      1573
#define POSTINC2                      1574
#define INDF2                         1575
#define FSR1L                         1576
#define PLUSW1                        1577
#define PREINC1                       1578
#define POSTDEC1                      1579
#define POSTINC1                      1580
#define INDF1                         1581
#define WREG                          1582
#define FSR0L                         1583
#define PLUSW0                        1584
#define PREINC0                       1585
#define POSTDEC0                      1586
#define POSTINC0                      1587
#define INDF0                         1588
#define INTCON3                       1589
#define INT1IF                        1590
#define INT1F                         1591
#define INT2IF                        1592
#define INT2F                         1593
#define INT1E                         1594
#define INT1IE                        1595
#define INT2IE                        1596
#define INT2E                         1597
#define INT1P                         1598
#define INT1IP                        1599
#define INT2IP                        1600
#define INT2P                         1601
#define INTCON2                       1602
#define RBIP                          1603
#define TMR0IP                        1604
#define INTEDG2                       1605
#define INTEDG1                       1606
#define INTEDG0                       1607
#define RBPU                          1608
#define NOT_RBPU                      1609
#define nRBPU                         1610
#define INTCON                        1611
#define RBIF                          1612
#define INT0F                         1613
#define INT0IF                        1614
#define T0IF                          1615
#define TMR0IF                        1616
#define RBIE                          1617
#define INT0E                         1618
#define INT0IE                        1619
#define T0IE                          1620
#define TMR0IE                        1621
#define PEIE                          1622
#define PEIE_GIEL                     1623
#define GIEL                          1624
#define GIE_GIEH                      1625
#define GIE                           1626
#define GIEH                          1627
#define PRODL                         1628
#define PRODH                         1629
#define TABLAT                        1630
#define TBLPTRL                       1631
#define TBLPTRH                       1632
#define TBLPTRU                       1633
#define ACSS                          1634
#define PCL                           1635
#define PCLATH                        1636
#define PCH                           1637
#define STKPTR0                       1638
#define STKPTR                        1639
#define SP0                           1640
#define STKPTR1                       1641
#define SP1                           1642
#define STKPTR2                       1643
#define SP2                           1644
#define SP3                           1645
#define STKPTR3                       1646
#define STKPTR4                       1647
#define SP4                           1648
#define STKUNF                        1649
#define STKOVF                        1650
#define STKFUL                        1651
#define TOSL                          1652
#define TOSH                          1653

#endif // _PIC18LF46K22_H_
